Revit 2024 API
BuiltInFailures.SlabShapeFailures.SlopeZero Property
 Adjusting this Line's Overhang will not affect its height because its slope is zero.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SlopeZero { get; }
Visual Basic
Public Shared ReadOnly Property SlopeZero As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SlopeZero {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SlabShapeFailures Class
Autodesk.Revit.DB Namespace